[
    {
        "title": "Personal Portfolio Website",
        "date": "2025",
        "description": "Developed a portfolio website using React to showcase my work, skills, and contact information. The project was bootstrapped with Vite, incorporates Material-UI as the UI library, and supports PWA functionality.",
        "url": "https://rsedaaghi.github.io/",
        "images": [],
        "technologies": [
            "React",
            "Vite",
            "Material-UI",
            "PWA"
        ]
    },
    {
        "title": "Backend Enhancement for the Educaite Website",
        "date": "2025",
        "description": "Continued developing the backend for the Educaite website. This phase included fixing the password reset process, enabling question creation and updates with custom notes, refining logic for delivering personalized content based on quiz scores, and completing support for user notes. Unfinished quizzes were cleaned up by removing outdated book entries. Support was added for the book reader module and panel APIs for chapter management. Other updates included correcting models for messages and report questions, finalizing user note functionalities, and improving overall panel APIs.",
        "url": "https://educaite.org/",
        "images": [
            {
                "src": "/assets/images/works/educaite/educaite_backend_github.png",
                "caption": "GitHub / educaite-core"
            }
        ],
        "technologies": [
            "Node.js",
            "PostgreSQL",
            "Docker"
        ]
    },
    {
        "title": "Implementation and Configuration of the Monitoring System for Rayehe Sepehr Salam Co. Dialysis Centers",
        "date": "2024",
        "description": "Hospital Information System (HIS) at Aria Teb Firouz. HIS is a comprehensive, integrated information system consisting of modules for managing patient appointments, medical, administrative, financial, and inventory services.",
        "url": "",
        "images": [
            {
                "src": "/assets/images/works/monitoring/monitoring_zabbix_1.png",
                "caption": "Admin panel in Zabbix showing the status of centers as operational and their network topology"
            },
            {
                "src": "/assets/images/works/monitoring/monitoring_zabbix_2.png",
                "caption": "Timeline view of network activity for each dialysis center"
            },
            {
                "src": "/assets/images/works/monitoring/monitoring_zabbix_3.png",
                "caption": "Docker containers running Zabbix agents for each center"
            }
        ],
        "technologies": [
            "Node.js",
            "Redis",
            "PostgreSQL",
            "Docker"
        ]
    },
    {
        "title": "Technical Support and Backend Development for the Electronic data capture (EDC) System",
        "date": "2023",
        "description": "Provided technical support and backend development for the EDC system at Aria Teb Firouz. The system simplifies the electronic collection, review, and processing of clinical trial data.",
        "url": "",
        "images": [],
        "technologies": [
            "Service-oriented architecture",
            "Node.js",
            "Redis",
            "gRPC",
            "PostgreSQL",
            "Docker"
        ]
    },
    {
        "title": "Development of an Automated Ore Image Processing System",
        "date": "2023",
        "description": "An automated mineral analysis system was designed to integrate hardware and software components for efficient ore image processing. The system employs a camera for capturing images, which are then transmitted to a Node.js-based server where Python-based image processing algorithms are executed. Following the processing stage, the extracted data is sent back to the user.",
        "url": "",
        "images": [
            {
                "src": "/assets/images/works/OIP/oip_intro.png",
                "caption": "Intro screen of the Ore Image Processing (OIP) system, presenting the interface for image uploads."
            },
            {
                "src": "/assets/images/works/OIP/oip_intro_image_chosen.png",
                "caption": "User selecting an image for processing within the OIP system interface."
            },
            {
                "src": "/assets/images/works/OIP/oip_processing.png",
                "caption": "Processing stage displaying real-time mineral size detection and analysis."
            },
            {
                "src": "/assets/images/works/OIP/oip_result.png",
                "caption": "Final results showing extracted mineral sizes and related analytical data."
            }
        ],
        "technologies": [
            "Node.js",
            "Docker",
            "Linux",
            "React",
            "Python"
        ]
    },
    {
        "title": "Development of the Admin Panel for the Educaite Website",
        "date": "2023",
        "description": "Continued developing the administrative panel and mobile application for Educaite, enabling educators to upload course content and automatically generate test questions using AI, thereby enhancing functionality and user experience.",
        "url": "https://educaite.org/",
        "images": [],
        "technologies": [
            "React"
        ]
    },
    {
        "title": "Development of Data Display Code for Automated Waste Collection Vehicles",
        "date": "2023",
        "description": "Implemented code to display data from sensor and camera systems installed on waste collection vehicles.",
        "url": "",
        "images": [],
        "technologies": [
            "C++",
            "Python",
            "Bootstrap"
        ]
    },
    {
        "title": "Smart Waste Collection System",
        "date": "2023",
        "description": "Designed a system where sensor and camera data from waste collection trucks are transmitted via Bluetooth and Wi-Fi to a tablet, then sent to a server. The project was executed by Bahar Afaq Shahr, a subsidiary of Bahar Rood Tehran, specializing in industrial trailers and urban service vehicles.",
        "url": "",
        "images": [],
        "technologies": [
            "C++",
            "Flutter"
        ]
    },
    {
        "title": "Development of a React-based PWA for Vehicle Tracking",
        "date": "2023",
        "description": "Created a progressive web application (PWA) using React for vehicle tracking and real-time location monitoring.",
        "url": "",
        "images": [],
        "technologies": [
            "Node.js",
            "React",
            "PWA"
        ]
    },
    {
        "title": "Digital Systems and Data Mining Laboratory Website – Amir Kabir University",
        "date": "2023",
        "description": "Developed an academic showcase website for the Digital Systems and Data Mining Laboratory at Amir Kabir University's Electrical Engineering Department. The site features research group profiles and allows admin-controlled updates and management.",
        "url": "https://ssail.aut.ac.ir/",
        "images": [],
        "technologies": [
            "PHP",
            "Wordpress",
            "Linux",
            "Bootstrap",
            "JQuery"
        ]
    },
    {
        "title": "Development of the Collective Reporting Module for the Hospital Information System (HIS)",
        "date": "2023",
        "description": "Implemented a comprehensive reporting module within Aria Teb Firouz's HIS, covering patient scheduling, medical, administrative, financial, and inventory management functionalities.",
        "url": "",
        "images": [],
        "technologies": [
            "Node.js",
            "SQL Query",
            "PostgreSQL",
            "Docker"
        ]
    },
    {
        "title": "Front-end Development for the Electronic Data Capture (EDC) System Panel",
        "date": "2022",
        "description": "Designed and developed the front-end interface of the EDC system panel using React and Material-UI, ensuring a responsive and intuitive user experience. Implemented Redux for efficient state management and integrated MUI Kit for a modern, consistent UI design. Supported English and Farsi language options to enhance accessibility and usability. The EDC system was developed to facilitate data collection for medical trials related to dialysis. It provided users with the ability to design custom forms, define study-specific steps, and manage structured participant data. Users could create input fields, customize field types, and apply validation rules for structured data entry. The system also supported conditional questions to guide participants through personalized data collection flows. Workflow and process management functionalities allowed users to define and track data collection steps efficiently. Additionally, administrative tools enabled role management with permissions settings, and participant management allowed users to add and organize individuals within the system. Advanced reporting features provided structured analytics with customizable filters, ensuring comprehensive insights into collected data.",
        "url": "",
        "images": [
            {
                "src": "/assets/images/works/edc/edc_dashboard.png",
                "caption": "Main dashboard of the EDC system displayed with the collapsed main menu. Overlays highlight a shrunk view of the login page, expanded profile menu, expanded language menu, and expanded main menu for better visualization of key navigation elements."
            },
            {
                "src": "/assets/images/works/edc/edc_admins.png",
                "caption": "Administrative panel of the EDC system displayed with overlays showcasing role management functionalities, including creating roles, editing roles, listing roles, modifying permissions, and viewing detailed permission settings assigned to administrators."
            },
            {
                "src": "/assets/images/works/edc/edc_people.png",
                "caption": "Participant management panel of the EDC system displayed, showing a list of participants (represented as people). Overlays highlight options for creating new participants or adding people to the system."
            },
            {
                "src": "/assets/images/works/edc/edc_create_input_field.png",
                "caption": "Interface for creating input fields displayed."
            },
            {
                "src": "/assets/images/works/edc/edc_form_input_field_edit.png",
                "caption": "Editing section of the form input fields displayed, allowing users to modify existing fields and define validation rules for structured data entry."
            },
            {
                "src": "/assets/images/works/edc/edc_conditional_questions.png",
                "caption": "Conditional question setup for the EDC system displayed, allowing users to define dependencies between questions based on participant responses."
            },
            {
                "src": "/assets/images/works/edc/edc_input_field_types.png",
                "caption": "List of available input field types in the EDC system displayed, showcasing customization options for structured data collection."
            },
            {
                "src": "/assets/images/works/edc/edc_processes.png",
                "caption": "Workflow and process management panel displayed, enabling users to define and monitor various steps involved in data collection and processing."
            },
            {
                "src": "/assets/images/works/edc/edc_case_study.png",
                "caption": "Case study section of the EDC system displayed, providing structured data collection for medical research. Users can define studies, configure data fields, and track participant responses."
            },
            {
                "src": "/assets/images/works/edc/edc_case_study_questions.png",
                "caption": "Case study question management section displayed. Overlays highlight the ability to create, edit, and organize study-specific questions for better data collection."
            },
            {
                "src": "/assets/images/works/edc/edc_report.png",
                "caption": "Report generation interface displayed."
            },
            {
                "src": "/assets/images/works/edc/edc_farsi.png",
                "caption": "Localized interface of the EDC system displayed in Farsi, demonstrating multilingual support to enhance accessibility and usability."
            }
        ],
        "technologies": [
            "React",
            "Material-UI"
        ]
    },
    {
        "title": "Technical Support and Backend Development for the Hospital Information System (HIS)",
        "date": "2022",
        "description": "Provided technical support and backend development for Aria Teb Firouz's integrated HIS.",
        "url": "",
        "images": [],
        "technologies": [
            "Node.js",
            "Redis",
            "PostgreSQL",
            "Docker"
        ]
    },
    {
        "title": "Technical Support, Supervision, and Monitoring of HIS Software",
        "date": "2022",
        "description": "Monitored and maintained HIS software across dialysis centers and supported the launch of HIS in new centers at Rayehe Sepehr Salam Co., a healthcare services company.",
        "url": "",
        "images": [],
        "technologies": [
            "Docker",
            "Linux",
            "Zabbix"
        ]
    },
    {
        "title": "Development of a Fare Estimation System for International Freight Shipping",
        "date": "2021",
        "description": "Built a web-based system providing freight information, consultation, price estimates, and online bidding for international cargo transportation.",
        "url": "",
        "images": [],
        "technologies": [
            "Bootstrap",
            "JQuery",
            "PHP"
        ]
    },
    {
        "title": "Development of an Intelligent Valve Manifold Monitoring System at Qazvin Gas Company",
        "date": "2021",
        "description": "Developed a management panel with user roles, access controls, log storage, mapping of organizations and installation sites, and real-time alerts via email/SMS for theft detection.",
        "url": "",
        "images": [],
        "technologies": [
            "Python",
            "WebSocket",
            "Leaflet",
            "JQuery",
            "SCSS",
            "Bootstrap"
        ]
    },
    {
        "title": "Object-Oriented Neural Network Training and Performance Reporting Code",
        "date": "2020",
        "description": "Implemented an object-oriented approach to train a multilayer neural network and report its performance after testing.",
        "url": "",
        "images": [],
        "technologies": [
            "Python"
        ]
    },
    {
        "title": "Development of the Methane Detector (MDet) Software",
        "date": "2020",
        "description": "Created a GUI application to display methane leak levels on a map and track drone movement, with color-coded severity indicators, as part of a joint project with Qazvin Gas Company.",
        "url": "",
        "images": [],
        "technologies": [
            "Python",
            "Leaflet"
        ]
    },
    {
        "title": "GUI Software for Price Difference Detection between Nobitex and Binance",
        "date": "2020",
        "description": "Developed a desktop application to detect and notify discrepancies in cryptocurrency prices between Nobitex and Binance exchanges.",
        "url": "",
        "images": [],
        "technologies": [
            "Python"
        ]
    },
    {
        "title": "Graduate Coursework Projects (Console and GUI Based)",
        "startDate": "2014",
        "endDate": "2016",
        "description": "Conducted a series of academic projects during postgraduate studies at Sharif University of Technology, widely regarded as the leading technological university in Iran. These projects, carried out between 2014 and 2016, utilized both console-based and GUI-based approaches, demonstrating proficiency in programming languages such as C++ and MATLAB.",
        "url": "",
        "images": [],
        "technologies": [
            "C++",
            "MATLAB"
        ]
    },
    {
        "title": "Console-Based Course Projects",
        "startDate": "2009",
        "endDate": "2014",
        "description": "Developed console-based projects as part of coursework during a Bachelor’s degree in Mechanical Engineering at Tabriz University of Technology from 2009 to 2013, with activities continuing until 2014. During this time, I built a strong foundation in programming algorithms through a dedicated programming course and further enhanced my skills by completing Harvard University's renowned CS50 course, led by David J. Malan, on the edX platform.",
        "url": "",
        "images": [],
        "technologies": [
            "C",
            "Fortran"
        ]
    },
    {
        "title": "Android Application Development: Mini Projects",
        "date": "2010",
        "description": "During the summers of my Bachelor’s degree in Mechanical Engineering at Tabriz University of Technology, I explored Android development and created two mini projects: a 'Guess the Number' game and a Salavat Counter application. This experience allowed me to delve into mobile programming using Java and Android, showcasing my eagerness to learn and innovate during my academic years.",
        "url": "",
        "images": [
            {
                "src": "/assets/images/works/android/android_icons.png",
                "caption": "Android device showcasing the icons of 'Guess the Number' and Salavat Counter applications."
            },
            {
                "src": "/assets/images/works/android/android_guess_game1.png",
                "caption": "'Guess the Number' game welcome screen (email updated to rsedaaghi@gmail.com)."
            },
            {
                "src": "/assets/images/works/android/android_guess_game2.png",
                "caption": "'Guess the Number' gameplay showing user interactions (email updated to rsedaaghi@gmail.com)."
            },
            {
                "src": "/assets/images/works/android/android_guess_game3.png",
                "caption": "'Guess the Number' gameplay showing user interactions (email updated to rsedaaghi@gmail.com)."
            },
            {
                "src": "/assets/images/works/android/android_guess_game4.png",
                "caption": "'Guess the Number' result display after user input (email updated to rsedaaghi@gmail.com)."
            },
            {
                "src": "/assets/images/works/android/android_counter1.png",
                "caption": "Salavat Counter app showing user-friendly interface (email updated to rsedaaghi@gmail.com)."
            },
            {
                "src": "/assets/images/works/android/android_counter2.png",
                "caption": "Salavat Counter app tracking counts in real time (email updated to rsedaaghi@gmail.com)."
            },
            {
                "src": "/assets/images/works/android/android_calc1.png",
                "caption": "Calculator application interface during early testing (labeled 'Designed by Parham' to reflect my preferred name)."
            },
            {
                "src": "/assets/images/works/android/android_calc2.png",
                "caption": "Calculator application interface during early testing (labeled 'Designed by Parham' to reflect my preferred name)."
            }
        ],
        "technologies": [
            "Java",
            "Android"
        ]
    },
    {
        "title": "Design and Development of Static Web Pages",
        "startDate": "2005",
        "endDate": "2011",
        "description": "Designed and developed static pages and themes for Blogfa and MihanBlog; activity continued until 2011. Blogfa and MihanBlog are popular Persian blogging platforms that allow users to create and manage blogs easily.",
        "url": "",
        "images": [],
        "technologies": [
            "HTML",
            "CSS"
        ]
    }
]